In [18]:
from pandas import Series, DataFrame

In [19]:
kakao = Series([100, 200])
print(kakao)

0    100
1    200
dtype: int64

In [20]:
raw_data = {'col0' : [1, 2, 3, 4],
            'col1' : [10, 20, 30, 40],
            'col2' : [100, 200, 300, 400]}
data = DataFrame(raw_data)
print(data)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [21]:
date = ['16.02.29', '16.02.26', '16.02.23', '16.02.27']
data1 = DataFrame(raw_data, index=date)
print(data1)

          col0  col1  col2
16.02.29     1    10   100
16.02.26     2    20   200
16.02.23     3    30   300
16.02.27     4    40   400

In [22]:
day_data1 = data1.loc['16.02.29']
print(day_data1)

col0      1
col1     10
col2    100
Name: 16.02.29, dtype: int64

In [23]:
col1 = data1['col1']
print(col1)

16.02.29    10
16.02.26    20
16.02.23    30
16.02.27    40
Name: col1, dtype: int64

In [24]:
print(data1.columns)
print(data1.index)

Index(['col0', 'col1', 'col2'], dtype='object')
Index(['16.02.29', '16.02.26', '16.02.23', '16.02.27'], dtype='object')

In [25]:
data1

          col0  col1  col2
16.02.29     1    10   100
16.02.26     2    20   200
16.02.23     3    30   300
16.02.27     4    40   400

In [26]:
data1.transpose()

      16.02.29  16.02.26  16.02.23  16.02.27
col0         1         2         3         4
col1        10        20        30        40
col2       100       200       300       400

In [27]:
data1.columns = ['A', 'B', 'C']
data1

          A   B    C
16.02.29  1  10  100
16.02.26  2  20  200
16.02.23  3  30  300
16.02.27  4  40  400

In [28]:
[[4, 9]] * 3

[[4, 9], [4, 9], [4, 9]]

In [29]:
data2 = data1.copy()
data2.index = [0, 1, 2, 3]
data2

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [30]:
(data2 > 20).any()

A    False
B     True
C     True
dtype: bool

In [31]:
(data2 > 20).any

<bound method DataFrame.any of        A      B     C
0  False  False  True
1  False  False  True
2  False   True  True
3  False   True  True>

In [37]:
data2[1:3].count()

A    2
B    2
C    2
dtype: int64

In [39]:
len(data2)

4